# Pandas ðŸ¼ (panel data => data over multiple time periods)
Powerful tool for data analysis.
Helps to work with tabular data.
**Why do we use Pandas?**
1. Used for analyzing, cleaning, exploring, and manipulating data.
2. Pandas allows us to analyze big data and make conclusions.
3. It is an important library in data science to get insights from data.  
<img src="images/pd_df.png" width=300 height=200/>

In [ ]:
%pip install pandas

In [3]:
import pandas as pd
pd.__version__

'2.2.3'

In [ ]:
# documentation
pd.read_csv?
#dir(pd)
#help(pd.read_csv)

In [5]:
print(pd.options.display.width)
pd.set_option('display.width', 300)
print(pd.options.display.max_rows)
#pd.describe_option()

80
60

In [6]:
import pandas as pd
from pathlib import Path

if Path('./data/olympics_1896_2004.csv').exists():
    odf = pd.read_csv(filepath_or_buffer='./data/olympics_1896_2004.csv', skiprows=5)
    print(odf.head())
print("***"*30)
if Path('./data/INNHotelsGroup_pastdata.csv').exists():
    hdf = pd.read_csv(filepath_or_buffer='./data/INNHotelsGroup_pastdata.csv')
    print(hdf.head())

   Year    City      Sport     Discipline        Athlete Name  NOC Gender  Event Event Gender   Medal  Position
0  1896  Athens    Cycling  Cycling Track       FLAMENG, LÃ©on  FRA    Men  100km            M    Gold         1
1  1896  Athens    Cycling  Cycling Track  KOLETTIS, Georgios  GRE    Men  100km            M  Silver         2
2  1896  Athens  Athletics      Athletics       LANE, Francis  USA    Men   100m            M  Bronze         3
3  1896  Athens  Athletics      Athletics    SZOKOLYI, Alajos  HUN    Men   100m            M  Bronze         3
4  1896  Athens  Athletics      Athletics       BURKE, Thomas  USA    Men   100m            M    Gold         1
******************************************************************************************
     booking_id  lead_time market_segment_type  no_of_special_requests  avg_price_per_room  no_of_adults  no_of_weekend_nights arrival_date  required_car_parking_space  no_of_week_nights booking_status rebooked
0  INNHG_101034          0              Online                       0               85.03             1                     1   2021-01-01                           0                  0   Not Canceled      NaN
1  INNHG_101035         34              Online                       2              125.10             2                     2   2021-01-01                           0                  0   Not Canceled      NaN
2  INNHG_101036         24              Online                       1               71.69             2                     2   2021-01-01                           0                  0   Not Canceled      NaN
3  INNHG_101037         23              Online                       0               84.70             1                     2   2021-01-01                           0                  0   Not Canceled      NaN
4  INNHG_101038         46              Online                       1              149.40             2                     2   2021-01-01                           0                  3       Canceled       No

In [17]:
print(odf.shape)
print("***"*30)
print(odf.columns)
print("***"*30)
print(odf.sample(2))
print("***"*30)
print("Output of describe function - \n",odf.describe())
print("***"*30)
print("Output of info function - \n", odf.info())
print("***"*30)
print("Output of dtype attribute - \n", odf.dtypes)

(27174, 11)
******************************************************************************************
Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete Name', 'NOC', 'Gender', 'Event', 'Event Gender', 'Medal', 'Position'], dtype='object')
******************************************************************************************
       Year    City       Sport    Discipline        Athlete Name  NOC Gender            Event Event Gender   Medal  Position
27012  2004  Athens  Volleyball    Volleyball     GARCIA, Ricardo  BRA    Men       volleyball            M    Gold         1
16436  1980  Moscow     Cycling  Cycling Road  KONECNY, Vlastibor  TCH    Men  team time trial            M  Bronze         3
******************************************************************************************
Output of describe function -
                Year      Position
count  27174.000000  27174.000000
mean    1964.685803      1.992566
std       31.590396      0.817469
min     1896.000000      1.000000
25%     1936.000000      1.000000
50%     1972.000000      2.000000
75%     1992.000000      3.000000
max     2004.000000      3.000000
******************************************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27174 entries, 0 to 27173
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Year          27174 non-null  int64
 1   City          27174 non-null  object
 2   Sport         27174 non-null  object
 3   Discipline    27174 non-null  object
 4   Athlete Name  27174 non-null  object
 5   NOC           27174 non-null  object
 6   Gender        27174 non-null  object
 7   Event         27174 non-null  object
 8   Event Gender  27174 non-null  object
 9   Medal         27174 non-null  object
 10  Position      27174 non-null  int64
dtypes: int64(2), object(9)
memory usage: 2.3+ MB
Output of info function -
 None
******************************************************************************************
Output of dtype attribute -
 Year             int64
City            object
Sport           object
Discipline      object
Athlete Name    object
NOC             object
Gender          object
Event           object
Event Gender    object
Medal           object
Position         int64
dtype: object

In [18]:
print(hdf.shape)
print("***"*30)
print(hdf.columns)
print("***"*30)
print(hdf.sample(2))
print("***"*30)
print(hdf.describe())
print("***"*30)
print(hdf.info())
print("***"*30)
print(hdf.dtypes)

(27093, 12)
******************************************************************************************
Index(['booking_id', 'lead_time', 'market_segment_type', 'no_of_special_requests', 'avg_price_per_room', 'no_of_adults', 'no_of_weekend_nights', 'arrival_date', 'required_car_parking_space', 'no_of_week_nights', 'booking_status', 'rebooked'], dtype='object')
******************************************************************************************
         booking_id  lead_time market_segment_type  no_of_special_requests  avg_price_per_room  no_of_adults  no_of_weekend_nights arrival_date  required_car_parking_space  no_of_week_nights booking_status rebooked
17591  INNHG_118625          6             Offline                       1                85.0             2                     1   2022-03-20                           0                  0   Not Canceled      NaN
761    INNHG_101795        292             Offline                       0                90.0             1                     0   2021-01-21                           0                  2   Not Canceled      NaN
******************************************************************************************
          lead_time  no_of_special_requests  avg_price_per_room  no_of_adults  no_of_weekend_nights  required_car_parking_space  no_of_week_nights
count  27093.000000            27093.000000        27093.000000  27093.000000          27093.000000                27093.000000       27093.000000
mean      81.605249                0.556454          101.025910      1.825822              0.778319                    0.028864           2.171373
std       84.901428                0.743715           34.557289      0.512182              0.861787                    0.167426           1.386023
min        0.000000                0.000000            0.000000      0.000000              0.000000                    0.000000           0.000000
25%       14.000000                0.000000           79.000000      2.000000              0.000000                    0.000000           1.000000
50%       55.000000                0.000000           97.000000      2.000000              1.000000                    0.000000           2.000000
75%      118.000000                1.000000          119.000000      2.000000              1.000000                    0.000000           3.000000
max      443.000000                5.000000          540.000000      4.000000              6.000000                    1.000000          17.000000
******************************************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27093 entries, 0 to 27092
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   booking_id                  27093 non-null  object
 1   lead_time                   27093 non-null  int64
 2   market_segment_type         27093 non-null  object
 3   no_of_special_requests      27093 non-null  int64
 4   avg_price_per_room          27093 non-null  float64
 5   no_of_adults                27093 non-null  int64
 6   no_of_weekend_nights        27093 non-null  int64
 7   arrival_date                27093 non-null  object
 8   required_car_parking_space  27093 non-null  int64
 9   no_of_week_nights           27093 non-null  int64
 10  booking_status              27093 non-null  object
 11  rebooked                    8857 non-null   object
dtypes: float64(1), int64(6), object(5)
memory usage: 2.5+ MB
None
******************************************************************************************
booking_id                     object
lead_time                       int64
market_segment_type            object
no_of_special_requests          int64
avg_price_per_room            float64
no_of_adults                    int64
no_of_weekend_nights            int64
arrival_date                   object
required_car_parking_space      int64
no_of_week_nights               int64
booking_status                 object
rebooked                       object
dtype: object

In [19]:
pd.get_option?

Signature:   pd.get_option(*args, **kwds) -> 'T'
Type:        CallableDynamicDoc
String form: <pandas._config.config.CallableDynamicDoc object at 0x105c734d0>
File:        ~/Learn/Repos/MyRepos/ai_ml_knowhow/.venv/lib/python3.12/site-packages/pandas/_config/config.py
Docstring:
get_option(pat)

Retrieves the value of the specified option.

Available options:

- compute.[use_bottleneck, use_numba, use_numexpr]
- display.[chop_threshold, colheader_justify, date_dayfirst, date_yearfirst,
  encoding, expand_frame_repr, float_format]
- display.html.[border, table_schema, use_mathjax]
- display.[large_repr, max_categories, max_columns, max_colwidth, max_dir_items,
  max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
  min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
  show_dimensions]
- display.unicode.[ambiguous_as_wide, east_asian_width]
- display.[width]
- future.[infer_string, no_silent_downcasting]
- io.excel.ods.[reader, writer]
- io.excel.xls.[reader]
- io.excel.xlsb.[reader]
- io.excel.xlsm.[reader, writer]
- io.excel.xlsx.[reader, writer]
- io.hdf.[default_format, dropna_table]
- io.parquet.[engine]
- io.sql.[engine]
- mode.[chained_assignment, copy_on_write, data_manager, sim_interactive,
  string_storage, use_inf_as_na]
- plotting.[backend]
- plotting.matplotlib.[register_converters]
- styler.format.[decimal, escape, formatter, na_rep, precision, thousands]
- styler.html.[mathjax]
- styler.latex.[environment, hrules, multicol_align, multirow_align]
- styler.render.[encoding, max_columns, max_elements, max_rows, repr]
- styler.sparse.[columns, index]

Parameters
----------
pat : str
    Regexp which should match a single option.
    Note: partial matches are supported for convenience, but unless you use the
    full option name (e.g. x.y.z.option_name), your code may break in future
    versions if new options with similar names are introduced.

Returns
-------
result : the value of the option

Raises
------
OptionError : if no such option exists

Notes
-----
Please reference the :ref:`User Guide <options>` for more information.

The available options with its descriptions:

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numba : bool
    Use the numba engine option for select operations if it is installed,
    the default is False
    Valid values: False,True
    [default: False] [currently: False]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller than the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table, or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 or None and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection and defaults to 20.
    [default: 20] [currently: 20]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 100]
display.max_dir_items : int
    The number of items that will be added to `dir(...)`. 'None' value means
    unlimited. Because dir is cached, changing this option will not immediately
    affect already existing dataframes until a column is deleted or added.

    This is for instance used to suggest columns from a dataframe to tab
    completion.
    [default: 100] [currently: 100]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]
display.max_seq_items : int or None
    When pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision in terms of number of places after the
    decimal, for regular formatting as well as scientific notation. Similar
    to ``precision`` in :meth:`numpy.set_printoptions`.
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 300]
future.infer_string Whether to infer sequence of str objects as pyarrow string dtype, which will be the default in pandas 3.0 (at which point this option will be deprecated).
    [default: False] [currently: False]
future.no_silent_downcasting Whether to opt-in to the future behavior which will *not* silently downcast results from Series and DataFrame `where`, `mask`, and `clip` methods. Silent downcasting will be removed in pandas 3.0 (at which point this option will be deprecated).
    [default: False] [currently: False]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf, calamine.
    [default: auto] [currently: auto]
io.excel.ods.writer : string
    The default Excel writer engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd, calamine.
    [default: auto] [currently: auto]
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb, calamine.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl, calamine.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl, calamine.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
io.sql.engine : string
    The default sql reader/writer engine. Available options:
    'auto', 'sqlalchemy', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.copy_on_write : bool
    Use new copy-view behaviour using Copy-on-Write. Defaults to False,
    unless overridden by the 'PANDAS_COPY_ON_WRITE' environment variable
    (if set to "1" for True, needs to be set before pandas is imported).
    [default: False] [currently: False]
mode.data_manager : string
    Internal data manager type; can be "block" or "array". Defaults to "block",
    unless overridden by the 'PANDAS_DATA_MANAGER' environment variable (needs
    to be set before pandas is imported).
    [default: block] [currently: block]
    (Deprecated, use `` instead.)
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.string_storage : string
    The default storage for StringDtype. This option is ignored if
    ``future.infer_string`` is set to True.
    [default: python] [currently: python]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).

    This option is deprecated in pandas 2.1.0 and will be removed in 3.0.
    [default: False] [currently: False]
    (Deprecated, use `` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    providing the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]
styler.format.decimal : str
    The character representation for the decimal separator for floats and complex.
    [default: .] [currently: .]
styler.format.escape : str, optional
    Whether to escape certain characters according to the given context; html or latex.
    [default: None] [currently: None]
styler.format.formatter : str, callable, dict, optional
    A formatter object to be used as default within ``Styler.format``.
    [default: None] [currently: None]
styler.format.na_rep : str, optional
    The string representation for values identified as missing.
    [default: None] [currently: None]
styler.format.precision : int
    The precision for floats and complex numbers.
    [default: 6] [currently: 6]
styler.format.thousands : str, optional
    The character representation for thousands separator for floats, int and complex.
    [default: None] [currently: None]
styler.html.mathjax : bool
    If False will render special CSS classes to table attributes that indicate Mathjax
    will not be used in Jupyter Notebook.
    [default: True] [currently: True]
styler.latex.environment : str
    The environment to replace ``\begin{table}``. If "longtable" is used results
    in a specific longtable environment format.
    [default: None] [currently: None]
styler.latex.hrules : bool
    Whether to add horizontal rules on top and bottom and below the headers.
    [default: False] [currently: False]
styler.latex.multicol_align : {"r", "c", "l", "naive-l", "naive-r"}
    The specifier for horizontal alignment of sparsified LaTeX multicolumns. Pipe
    decorators can also be added to non-naive values to draw vertical
    rules, e.g. "\|r" will draw a rule on the left side of right aligned merged cells.
    [default: r] [currently: r]
styler.latex.multirow_align : {"c", "t", "b"}
    The specifier for vertical alignment of sparsified LaTeX multirows.
    [default: c] [currently: c]
styler.render.encoding : str
    The encoding used for output HTML and LaTeX files.
    [default: utf-8] [currently: utf-8]
styler.render.max_columns : int, optional
    The maximum number of columns that will be rendered. May still be reduced to
    satisfy ``max_elements``, which takes precedence.
    [default: None] [currently: None]
styler.render.max_elements : int
    The maximum number of data-cell (<td>) elements that will be rendered before
    trimming will occur over columns, rows or both if needed.
    [default: 262144] [currently: 262144]
styler.render.max_rows : int, optional
    The maximum number of rows that will be rendered. May still be reduced to
    satisfy ``max_elements``, which takes precedence.
    [default: None] [currently: None]
styler.render.repr : str
    Determine which output to use in Jupyter Notebook in {"html", "latex"}.
    [default: html] [currently: html]
styler.sparse.columns : bool
    Whether to sparsify the display of hierarchical columns. Setting to False will
    display each explicit level element in a hierarchical key for each column.
    [default: True] [currently: True]
styler.sparse.index : bool
    Whether to sparsify the display of a hierarchical index. Setting to False will
    display each explicit level element in a hierarchical key for each row.
    [default: True] [currently: True]

Examples
--------
>>> pd.get_option('display.max_columns')  # doctest: +SKIP
4

In [21]:
print(pd.get_option('display.width'))
pd.set_option('display.width', 1000)
odf.sample(5)

1000

       Year         City      Sport     Discipline       Athlete Name  NOC Gender                       Event Event Gender   Medal  Position
21963  1996      Atlanta    Cycling  Cycling Track        WOODS, Dean  AUS    Men        Team Pursuit (4000m)            M  Bronze         3
23178  2000       Sydney  Taekwondo      Taekwondo     GENTIL, Pascal  FRA    Men                     + 80 kg            M  Bronze         3
24431  2000       Sydney   Handball       Handball      LINDGREN, Ola  SWE    Men                    handball            M  Silver         2
17431  1984  Los Angeles     Rowing         Rowing      NIELSEN, Lars  DEN    Men  four without coxswain (4-)            M  Bronze         3
557    1900        Paris      Rugby          Rugby  LANDVOIGT, Arnold  GER    Men                       rugby            M  Silver         2

In [8]:
print(odf['Athlete Name'], type(odf['Athlete Name']))
print("***"*30)
print(type(odf['Athlete Name']))
print("***"*30)
# Series becomes attribute
print(odf.Discipline)

0             FLAMENG, LÃ©on
1        KOLETTIS, Georgios
2             LANE, Francis
3          SZOKOLYI, Alajos
4             BURKE, Thomas
                ...
27169    LOGOUNOVA, Tatiana
27170         SIVKOVA, Anna
27171        BOKEL, Claudia
27172       DUPLITZER, Imke
27173     HEIDEMANN, Britta
Name: Athlete Name, Length: 27174, dtype: object <class 'pandas.core.series.Series'>
******************************************************************************************
<class 'pandas.core.series.Series'>
******************************************************************************************
0        Cycling Track
1        Cycling Track
2            Athletics
3            Athletics
4            Athletics
             ...
27169          Fencing
27170          Fencing
27171          Fencing
27172          Fencing
27173          Fencing
Name: Discipline, Length: 27174, dtype: object

In [26]:
print(odf['Year'].unique(), odf['Year'].value_counts())
print("***"*30)
print(odf['Sport'].unique(), odf['Sport'].value_counts())

[1896 1900 1904 1908 1912 1920 1924 1928 1932 1936 1948 1952 1956 1960
 1964 1968 1972 1976 1980 1984 1988 1992 1996 2000 2004] Year
2000    2015
2004    1998
1996    1859
1992    1705
1988    1546
1984    1459
1980    1387
1976    1305
1920    1298
1972    1185
1968    1031
1964    1010
1952     889
1956     885
1912     885
1924     884
1960     882
1936     875
1948     814
1908     804
1928     710
1932     615
1900     512
1904     470
1896     151
Name: count, dtype: int64
******************************************************************************************
['Cycling' 'Athletics' 'Aquatics' 'Shooting' 'Tennis' 'Fencing'
 'Weightlifting' 'Gymnastics' 'Wrestling' 'Sailing' 'Archery'
 'Basque Pelota' 'Cricket' 'Croquet' 'Rowing' 'Football' 'Equestrian'
 'Golf' 'Polo' 'Rugby' 'Tug of War' 'Boxing' 'Roque' 'Lacrosse'
 'Water Motorsports' 'Rackets' 'Hockey' 'Jeu de paume' 'Skating'
 'Modern Pentathlon' 'Ice Hockey' 'Canoe / Kayak' 'Basketball' 'Handball'
 'Judo' 'Volleyball' 'Table Tennis' 'Baseball' 'Badminton' 'Softball'
 'Taekwondo' 'Triathlon'] Sport
Aquatics             3481
Athletics            3271
Rowing               2379
Gymnastics           2115
Fencing              1485
Football             1279
Hockey               1227
Wrestling            1069
Shooting             1060
Sailing              1007
Cycling               954
Canoe / Kayak         918
Basketball            868
Equestrian            849
Volleyball            826
Handball              801
Boxing                798
Weightlifting         503
Judo                  379
Archery               281
Baseball              263
Tennis                254
Rugby                 192
Modern Pentathlon     168
Softball              135
Badminton              96
Table Tennis           96
Tug of War             94
Polo                   66
Lacrosse               59
Taekwondo              48
Golf                   30
Ice Hockey             27
Skating                27
Cricket                24
Triathlon              12
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Jeu de paume            3
Roque                   3
Name: count, dtype: int64

In [28]:
# What is the time range covered in this dataset?
print(f"Time range covered = {odf['Year'].unique()}")
print(f"They span {int(odf['Year'].min())} to {int(odf['Year'].max())}")

Time range covered = [1896 1900 1904 1908 1912 1920 1924 1928 1932 1936 1948 1952 1956 1960
 1964 1968 1972 1976 1980 1984 1988 1992 1996 2000 2004]
They span 1896 to 2004

In [29]:
# What are the types of medals awarded?
print(f"Types of medals awarded = {odf['Medal'].unique()}")

Types of medals awarded = ['Gold' 'Silver' 'Bronze']

In [30]:
# Across all of the Olympic Games, how many gold, silver, and bronze medals have there been?
print(odf['Medal'].unique(), odf['Medal'].value_counts())

['Gold' 'Silver' 'Bronze'] Medal
Gold      9181
Silver    9014
Bronze    8979
Name: count, dtype: int64

In [31]:
# What are the different National Olympic Committees (NOCs)?
odf.NOC.unique()

array(['FRA', 'GRE', 'USA', 'HUN', 'GER', 'AUT', 'GBR', 'AUS', 'DEN',
       'ZZX', 'SUI', 'IND', 'NED', 'CAN', 'NOR', 'BEL', 'ESP', 'BOH',
       'ITA', 'SWE', 'CUB', 'RU1', 'FIN', 'RSA', 'ANZ', 'LUX', 'EST',
       'BRA', 'JPN', 'TCH', 'NZL', 'ARG', 'HAI', 'POL', 'URU', 'YUG',
       'ROU', 'POR', 'EGY', 'PHI', 'IRL', 'CHI', 'MEX', 'LAT', 'TUR',
       'KOR', 'PAN', 'JAM', 'SRI', 'PER', 'PUR', 'IRI', 'TRI', 'URS',
       'LIB', 'BUL', 'VEN', 'EUA', 'PAK', 'ISL', 'BAH', 'BWI', 'GHA',
       'IRQ', 'SIN', 'TPE', 'ETH', 'MAR', 'TUN', 'NGR', 'KEN', 'FRG',
       'MGL', 'GDR', 'UGA', 'CMR', 'PRK', 'COL', 'NIG', 'BER', 'THA',
       'TAN', 'GUY', 'ZIM', 'ZAM', 'CHN', 'CIV', 'DOM', 'ALG', 'SYR',
       'SUR', 'CRC', 'SEN', 'AHO', 'DJI', 'ISV', 'INA', 'EUN', 'NAM',
       'IOP', 'QAT', 'ISR', 'LTU', 'CRO', 'SLO', 'MAS', 'RUS', 'UKR',
       'TGA', 'ARM', 'BLR', 'MDA', 'ECU', 'KAZ', 'AZE', 'BDI', 'SVK',
       'CZE', 'UZB', 'GEO', 'MOZ', 'HKG', 'KGZ', 'BAR', 'KSA', 'VIE',
       'MKD', 'KUW', 'ERI', 'SCG', 'UAE', 'PAR'], dtype=object)

In [35]:
## Rename
odf.rename(columns={'Athlete Name': 'Athlete_Name', 'Event Gender': 'Event_Gender'})
print(odf.head(3))
# Few other ways of changing column names. Usage of header=0 in read-csv() function

   Year    City      Sport     Discipline        Athlete_Name  NOC Gender  Event Event_Gender   Medal  Position
0  1896  Athens    Cycling  Cycling Track       FLAMENG, LÃ©on  FRA    Men  100km            M    Gold         1
1  1896  Athens    Cycling  Cycling Track  KOLETTIS, Georgios  GRE    Men  100km            M  Silver         2
2  1896  Athens  Athletics      Athletics       LANE, Francis  USA    Men   100m            M  Bronze         3

In [39]:
print(odf.sample(5))
print("***"*30)
print(odf.columns)

       Year       City          Sport       Discipline          Athlete_Name  NOC Gender                     Event Event_Gender   Medal  Position
10413  1960       Rome         Hockey           Hockey   ROIG JUNYENT, Pedro  ESP    Men                    hockey            M  Bronze         3
12830  1972     Munich       Aquatics         Swimming           SPITZ, Mark  USA    Men            200m butterfly            M    Gold         1
2857   1920    Antwerp       Aquatics         Swimming  KEALOHA, Warren Paoa  USA    Men           100m backstroke            M    Gold         1
23809  2000     Sydney  Canoe / Kayak  Canoe / Kayak F         MERKOV, Petar  BUL    Men  K-1 1000m (kayak single)            M  Silver         2
19914  1992  Barcelona      Athletics        Athletics           IMOH, Chidi  NGR    Men              4x100m relay            M  Silver         2
******************************************************************************************
Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete_Name', 'NOC', 'Gender', 'Event', 'Event_Gender', 'Medal', 'Position'], dtype='object')

In [49]:
# Drop a series/column => coming from Database world
print(odf.sample(5))
print("***"*30)
print(odf.drop('Position', axis=1).head(5))
print("***"*30)
print(odf.drop(0, axis=0))

       Year     City       Sport   Discipline                      Athlete_Name  NOC Gender              Event Event_Gender   Medal  Position
6857   1936   Berlin    Handball     Handball                   BANDHOLZ, Willi  GER    Men           handball            M    Gold         1
25969  2004   Athens    Baseball     Baseball       GOURRIEL CASTILLO, Yulieski  CUB    Men           baseball            M    Gold         1
10547  1960     Rome  Equestrian      Jumping               CHAPOT, Frank Davis  USA    Men               team            X  Silver         2
4033   1920  Antwerp  Gymnastics  Artistic G.  STEFFENSEN, Wilhelm Marius Bakke  NOR    Men  team, free system            M  Silver         2
24891  2000   Sydney  Equestrian     Dressage                    WERTH, Isabell  GER  Women               team            X    Gold         1
******************************************************************************************
   Year    City      Sport     Discipline        Athlete_Name  NOC Gender  Event Event_Gender   Medal
0  1896  Athens    Cycling  Cycling Track       FLAMENG, LÃ©on  FRA    Men  100km            M    Gold
1  1896  Athens    Cycling  Cycling Track  KOLETTIS, Georgios  GRE    Men  100km            M  Silver
2  1896  Athens  Athletics      Athletics       LANE, Francis  USA    Men   100m            M  Bronze
3  1896  Athens  Athletics      Athletics    SZOKOLYI, Alajos  HUN    Men   100m            M  Bronze
4  1896  Athens  Athletics      Athletics       BURKE, Thomas  USA    Men   100m            M    Gold
******************************************************************************************
       Year    City      Sport     Discipline        Athlete_Name  NOC Gender      Event Event_Gender   Medal  Position
1      1896  Athens    Cycling  Cycling Track  KOLETTIS, Georgios  GRE    Men      100km            M  Silver         2
2      1896  Athens  Athletics      Athletics       LANE, Francis  USA    Men       100m            M  Bronze         3
3      1896  Athens  Athletics      Athletics    SZOKOLYI, Alajos  HUN    Men       100m            M  Bronze         3
4      1896  Athens  Athletics      Athletics       BURKE, Thomas  USA    Men       100m            M    Gold         1
5      1896  Athens  Athletics      Athletics      HOFMANN, Fritz  GER    Men       100m            M  Silver         2
...     ...     ...        ...            ...                 ...  ...    ...        ...          ...     ...       ...
27169  2004  Athens    Fencing        Fencing  LOGOUNOVA, Tatiana  RUS  Women  Ã©pÃ©e team            W    Gold         1
27170  2004  Athens    Fencing        Fencing       SIVKOVA, Anna  RUS  Women  Ã©pÃ©e team            W    Gold         1
27171  2004  Athens    Fencing        Fencing      BOKEL, Claudia  GER  Women  Ã©pÃ©e team            W  Silver         2
27172  2004  Athens    Fencing        Fencing     DUPLITZER, Imke  GER  Women  Ã©pÃ©e team            W  Silver         2
27173  2004  Athens    Fencing        Fencing   HEIDEMANN, Britta  GER  Women  Ã©pÃ©e team            W  Silver         2

[27173 rows x 11 columns]

In [ ]:
# filtering rows. Operator => ==, !=, <, <=, >, >=, &, |, ~
import pandas as pd

if Path('./data/olympics_1896_2004.csv').exists():
    odf = pd.read_csv(filepath_or_buffer='./data/olympics_1896_2004.csv', skiprows=5).drop('Position', axis=1)

print(odf.Year.dtype)
first_olympics = (odf.Year == 1896)
print(type(first_olympics))
print("****"*30)
print(odf[first_olympics])
print("****"*30)
print(odf[odf['Year'] == 1896])
print("****"*30)
print(odf[odf['Sport'] == "Cycling" ])
print("****"*30)

int64
<class 'pandas.core.series.Series'>
************************************************************************************************************************
     Year    City       Sport     Discipline          Athlete Name  NOC Gender        Event Event Gender   Medal
0    1896  Athens     Cycling  Cycling Track         FLAMENG, LÃ©on  FRA    Men        100km            M    Gold
1    1896  Athens     Cycling  Cycling Track    KOLETTIS, Georgios  GRE    Men        100km            M  Silver
2    1896  Athens   Athletics      Athletics         LANE, Francis  USA    Men         100m            M  Bronze
3    1896  Athens   Athletics      Athletics      SZOKOLYI, Alajos  HUN    Men         100m            M  Bronze
4    1896  Athens   Athletics      Athletics         BURKE, Thomas  USA    Men         100m            M    Gold
..    ...     ...         ...            ...                   ...  ...    ...          ...          ...     ...
146  1896  Athens   Athletics      Athletics       CONNOLLY, James  USA    Men  triple jump            M    Gold
147  1896  Athens   Athletics      Athletics    TUFFERI, Alexandre  FRA    Men  triple jump            M  Silver
148  1896  Athens  Gymnastics    Artistic G.  WEINGÃ„RTNER, Hermann  GER    Men        vault            M  Bronze
149  1896  Athens  Gymnastics    Artistic G.        SCHUMANN, Carl  GER    Men        vault            M    Gold
150  1896  Athens  Gymnastics    Artistic G.         ZUTTER, Louis  SUI    Men        vault            M  Silver

[151 rows x 10 columns]
************************************************************************************************************************
     Year    City       Sport     Discipline          Athlete Name  NOC Gender        Event Event Gender   Medal
0    1896  Athens     Cycling  Cycling Track         FLAMENG, LÃ©on  FRA    Men        100km            M    Gold
1    1896  Athens     Cycling  Cycling Track    KOLETTIS, Georgios  GRE    Men        100km            M  Silver
2    1896  Athens   Athletics      Athletics         LANE, Francis  USA    Men         100m            M  Bronze
3    1896  Athens   Athletics      Athletics      SZOKOLYI, Alajos  HUN    Men         100m            M  Bronze
4    1896  Athens   Athletics      Athletics         BURKE, Thomas  USA    Men         100m            M    Gold
..    ...     ...         ...            ...                   ...  ...    ...          ...          ...     ...
146  1896  Athens   Athletics      Athletics       CONNOLLY, James  USA    Men  triple jump            M    Gold
147  1896  Athens   Athletics      Athletics    TUFFERI, Alexandre  FRA    Men  triple jump            M  Silver
148  1896  Athens  Gymnastics    Artistic G.  WEINGÃ„RTNER, Hermann  GER    Men        vault            M  Bronze
149  1896  Athens  Gymnastics    Artistic G.        SCHUMANN, Carl  GER    Men        vault            M    Gold
150  1896  Athens  Gymnastics    Artistic G.         ZUTTER, Louis  SUI    Men        vault            M  Silver

[151 rows x 10 columns]
************************************************************************************************************************
       Year    City    Sport     Discipline            Athlete Name  NOC Gender        Event Event Gender   Medal
0      1896  Athens  Cycling  Cycling Track           FLAMENG, LÃ©on  FRA    Men        100km            M    Gold
1      1896  Athens  Cycling  Cycling Track      KOLETTIS, Georgios  GRE    Men        100km            M  Silver
11     1896  Athens  Cycling  Cycling Track           SCHMAL, Adolf  AUT    Men         10km            M  Bronze
12     1896  Athens  Cycling  Cycling Track            MASSON, Paul  FRA    Men         10km            M    Gold
13     1896  Athens  Cycling  Cycling Track           FLAMENG, LÃ©on  FRA    Men         10km            M  Silver
...     ...     ...      ...            ...                     ...  ...    ...          ...          ...     ...
26686  2004  Athens  Cycling  Cycling Track        SLYUSAREVA, Olga  RUS  Women  points race            W    Gold
26687  2004  Athens  Cycling  Cycling Track  GUERRERO MENDEZ, Belem  MEX  Women  points race            W  Silver
26830  2004  Athens  Cycling  Cycling Track            MEARES, Anna  AUS  Women       sprint            W  Bronze
26831  2004  Athens  Cycling  Cycling Track       MUENZER, Lori-Ann  CAN  Women       sprint            W    Gold
26832  2004  Athens  Cycling  Cycling Track       ABASSOVA, Tamilla  RUS  Women       sprint            W  Silver

[954 rows x 10 columns]
************************************************************************************************************************

In [89]:
print(type(odf[(odf['Year'] == 1896) | (odf['Year'] == 2004)]))
print(odf[(odf['Year'] == 1896) | (odf['Year'] == 2004)]['City'].unique())
print(type(odf['City'].unique()))
print(odf['City'].unique())
print("****"*30)
for city in odf['City'].unique():
    print(f"Olympics was held in {city} in the following years:")
    print(odf[odf['City'] == city]['Year'].unique())
    print("****"*30)
first_men_100m = odf[(odf['Year'] == 1896) & (odf['Gender'] == "Men") & (odf['Event'] == "100m")]
print(first_men_100m[['City', 'Year', 'Gender', 'Event']], "\n", len(first_men_100m))

<class 'pandas.core.frame.DataFrame'>
['Athens']
<class 'numpy.ndarray'>
['Athens' 'Paris' 'St Louis' 'London' 'Stockholm' 'Antwerp' 'Amsterdam'
 'Los Angeles' 'Berlin' 'Helsinki' 'Melbourne / Stockholm' 'Rome' 'Tokyo'
 'Mexico' 'Munich' 'Montreal' 'Moscow' 'Seoul' 'Barcelona' 'Atlanta'
 'Sydney']
************************************************************************************************************************
Olympics was held in Athens in the following years:
[1896 2004]
************************************************************************************************************************
Olympics was held in Paris in the following years:
[1900 1924]
************************************************************************************************************************
Olympics was held in St Louis in the following years:
[1904]
************************************************************************************************************************
Olympics was held in London in the following years:
[1908 1948]
************************************************************************************************************************
Olympics was held in Stockholm in the following years:
[1912]
************************************************************************************************************************
Olympics was held in Antwerp in the following years:
[1920]
************************************************************************************************************************
Olympics was held in Amsterdam in the following years:
[1928]
************************************************************************************************************************
Olympics was held in Los Angeles in the following years:
[1932 1984]
************************************************************************************************************************
Olympics was held in Berlin in the following years:
[1936]
************************************************************************************************************************
Olympics was held in Helsinki in the following years:
[1952]
************************************************************************************************************************
Olympics was held in Melbourne / Stockholm in the following years:
[1956]
************************************************************************************************************************
Olympics was held in Rome in the following years:
[1960]
************************************************************************************************************************
Olympics was held in Tokyo in the following years:
[1964]
************************************************************************************************************************
Olympics was held in Mexico in the following years:
[1968]
************************************************************************************************************************
Olympics was held in Munich in the following years:
[1972]
************************************************************************************************************************
Olympics was held in Montreal in the following years:
[1976]
************************************************************************************************************************
Olympics was held in Moscow in the following years:
[1980]
************************************************************************************************************************
Olympics was held in Seoul in the following years:
[1988]
************************************************************************************************************************
Olympics was held in Barcelona in the following years:
[1992]
************************************************************************************************************************
Olympics was held in Atlanta in the following years:
[1996]
************************************************************************************************************************
Olympics was held in Sydney in the following years:
[2000]
************************************************************************************************************************
     City  Year Gender Event
2  Athens  1896    Men  100m
3  Athens  1896    Men  100m
4  Athens  1896    Men  100m
5  Athens  1896    Men  100m
 4

In [101]:
# Cleaning and tranforming data
import pandas as pd

if Path('./data/olympics_1896_2004.csv').exists():
    odf = pd.read_csv(filepath_or_buffer='./data/olympics_1896_2004.csv', skiprows=5)

print(odf['Athlete Name'].str.lower())
print(odf.head(10))
print(odf['Event'].str.capitalize().unique())

0             flameng, lÃ©on
1        kolettis, georgios
2             lane, francis
3          szokolyi, alajos
4             burke, thomas
                ...
27169    logounova, tatiana
27170         sivkova, anna
27171        bokel, claudia
27172       duplitzer, imke
27173     heidemann, britta
Name: Athlete Name, Length: 27174, dtype: object
   Year    City      Sport     Discipline        Athlete Name  NOC Gender                       Event Event Gender   Medal  Position
0  1896  Athens    Cycling  Cycling Track       FLAMENG, LÃ©on  FRA    Men                       100km            M    Gold         1
1  1896  Athens    Cycling  Cycling Track  KOLETTIS, Georgios  GRE    Men                       100km            M  Silver         2
2  1896  Athens  Athletics      Athletics       LANE, Francis  USA    Men                        100m            M  Bronze         3
3  1896  Athens  Athletics      Athletics    SZOKOLYI, Alajos  HUN    Men                        100m            M  Bronze         3
4  1896  Athens  Athletics      Athletics       BURKE, Thomas  USA    Men                        100m            M    Gold         1
5  1896  Athens  Athletics      Athletics      HOFMANN, Fritz  GER    Men                        100m            M  Silver         2
6  1896  Athens   Aquatics       Swimming       HAJOS, Alfred  HUN    Men              100m freestyle            M    Gold         1
7  1896  Athens   Aquatics       Swimming    HERSCHMANN, Otto  AUT    Men              100m freestyle            M  Silver         2
8  1896  Athens   Aquatics       Swimming   DRIVAS, Dimitrios  GRE    Men  100m freestyle for sailors            M  Bronze         3
9  1896  Athens   Aquatics       Swimming  MALOKINIS, Ioannis  GRE    Men  100m freestyle for sailors            M    Gold         1
['100km' '100m' '100m freestyle' '100m freestyle for sailors' '10km'
 '110m hurdles' '12-hour race' '1200m freestyle' '1500m' '1km time trial'
 '25m army pistol' '25m rapid fire pistol (60 shots)' '400m'
 '400m freestyle' '50m pistol (60 shots)' '800m' 'Sprint indivual'
 'Army rifle, 200m' 'Army rifle, 300m' 'Discus throw' 'Doubles'
 'Foil individual' 'Foil, masters' 'Heavyweight - one hand lift'
 'Heavyweight - two hand lift' 'High jump' 'Horizontal bar'
 'Individual road race' 'Long jump' 'Marathon' 'Open event'
 'Parallel bars' 'Pole vault' 'Pommel horse' 'Rings' 'Rope climbing'
 'Sabre individual' 'Shot put' 'Singles' 'Team, horizontal bar'
 'Team, parallel bars' 'Triple jump' 'Vault' '0.5-1t' '10-20t'
 '1500m freestyle' '200m' '200m backstroke' '200m freestyle'
 '200m hurdles' '200m obstacle event' '200m team swimming' '25 kilometres'
 '3-10t' '3000m steeplechase' '4000m freestyle' '4000m steeplechase'
 '400m hurdles' '5000m team' '50m army pistol, team' '60m'
 'Army rifle, 300m, 3 positions' 'Army rifle, 300m, kneeling'
 'Army rifle, 300m, prone' 'Army rifle, 300m, standing' 'Au chapelet, 33m'
 'Au chapelet, 50m' 'Au cordon dorÃ©, 33m' 'Au cordon dorÃ©, 50m'
 'Cesta punta' 'Cricket' 'Double' 'Eight with coxswain (8+)' 'Football'
 'Four-oared shell with coxswain (4-)' 'Free rifle, team' 'Hammer throw'
 'High jump, standing' 'Individual' 'Individual 1 ball'
 'Individual 2 balls' 'Individual all-round' 'Long jump individual'
 'Long jump, standing' 'Mixed doubles' 'Open class'
 'Pair-oared shell with coxswain (2+)' 'Polo' 'Rugby' 'Sabre, masters'
 'Single sculls (1x)' 'Sur la perche Ã  la herse'
 'Sur la perche Ã  la pyramide' 'Trap (125 targets)'
 'Triple jump, standing' 'Tug of war' 'Underwater swimming' 'Water polo'
 'Ã‰pÃ©e individual' 'Ã‰pÃ©e, amateurs and masters' 'Ã‰pÃ©e, masters'
 '+ 71.67kg (heavyweight)' '- 47.63kg (flyweight)'
 '- 47.6kg (light-flyweight)' '1 mile (1609.3m)' '1/2 mile (804.7m)'
 '1/3 mile (536.5m)' '1/4 mile (402.3m)' '100m backstroke' '10m platform'
 '2 miles (3.218km)' '25 miles (40.232km)' '400m breaststroke'
 '47.6 - 52.16kg (flyweight)' '47.63 - 52.16kg (bantamweight)'
 '4miles team' '4x50y freestyle relay' '5 miles (8.046km)'
 '50y freestyle (45.72m)' '52.16 - 56.7kg (bantamweight)'
 '52.16 - 56.7kg (featherweight)' '56.7 - 61.23kg (featherweight)'
 '56.7 - 61.24kg (lightweight)' '56lb weight throw (25.4kg)'
 '61.23 - 65.77kg (lightweight)' '61.24 - 65.77kg (welterweight)'
 '65.77 - 71.67kg (middleweight)' '65.77 - 71.67kg (welterweight)'
 '880y freestyle (804.66m)' 'All-around dumbbell contest' 'Club swinging'
 'Combined 3 events' 'Combined 4 events' 'Coxless pair (2-)' 'Decathlon'
 'Double american round (60y - 50y - 40y)'
 'Double columbia round (50y - 40y - 30y)'
 'Double national round (60y - 50y)' 'Double sculls (2x)'
 'Double york round (100y - 80y - 60y)' 'Foil team'
 'Four without coxswain (4-)' 'Lacrosse' 'Plunge for distance'
 'Stick, single' 'Team' 'Team competition' 'Team round 60y'
 'Teams fita round' 'Triathlon (long jump / shot put / 100 yards)'
 '+ 73kg (heavyweight)' '+ 93kg (super heavyweight)'
 '- 52.62kg (bantamweight)' '- 54kg (bantamweight)'
 '- 66.6kg (lightweight)' '1000y free rifle, prone'
 '100m running deer, double shots' '100m running deer, single shots'
 '100m running deer, single shots, team' '10miles walk (16093m)' '12m'
 '1980 yards pursuit, team' '2000m tandem' '200m breaststroke' '20km'
 '25y small bore rifle, disappearing target'
 '25y small bore rifle, moving target'
 '300m free rifle 3 positions (3x40 shots)' '3200m steeplechase'
 '3500m walk' '3m springboard' '3miles team (4828m)'
 '4x200m freestyle relay' '4x400m relay' '5 miles (8047m)'
 '50+100y small bore rifle, team' '5000m' '50m rifle prone (60 shots)'
 '50y army pistol, team' '52.62 - 57.15kg (featherweight)'
 '54 - 60.3kg (featherweight)' '57.15 - 63.5kg (lightweight)'
 '60.3 - 66.6kg (lightweight)' '63.5 - 71.67kg (middleweight)'
 '66.6 - 73kg (middleweight)' '6m' '73 - 93kg (light-heavyweight)' '7m'
 '8m' '8m class c' 'One lap (660y) sprint' 'Class b up to 60 feet'
 'Clay pigeons, team' 'Continental style 50m' 'Discus throw ancient style'
 'Doubles indoor' 'Hockey' 'Javelin throw' 'Javelin throw freestyle'
 'National round (60y - 50y)' 'Open class a' 'Pairs' 'Rifle, team'
 'Sabre team' 'Singles indoor' 'Special figures'
 'York round (100y - 80y - 60y)' 'Ã‰pÃ©e team'
 '+ 82.5kg (super heavyweight)' '- 60kg (featherweight)' '10000m'
 '10000m walk' '10m' '25m small bore rifle, team' '25m small rifle'
 '3000m team' '30m army pistol, team' '4x100m freestyle relay'
 '4x100m relay' '50m small bore rifle, team' '60 - 67.5kg (lightweight)'
 '600m free rifle' '67.5 - 75kg (middleweight)'
 '75 - 82.5kg (light-heavyweight)' 'Individual competition'
 'Coxed fours jugriggers' 'Cross country individual' 'Cross country team'
 'Discus throw, both hands' 'Individual time trial'
 'Javelin throw, both hands' 'Mixed doubles indoor' 'Pentathlon'
 'Plain high diving' 'Shot put, both hands' 'Team time trial'
 'Team, swedish system' 'Team, free system' '+ 79.38kg (heavyweight)'
 '+ 80kg (heavyweight)' '+ 82.5kg, one-two hand 3 events (heavyweight)'
 '+ 82kg (super heavyweight)' '- 50.8kg (flyweight)'
 '- 60kg, one-two hand 3 events (featherweight)'
 '100m running deer, double shots, team' '10m (rating 1907)'
 '10m (rating 1919)' '12 foot dinghy' '12m (rating 1907)'
 '12m (rating 1919)' '18 foot dinghy' '300+600m free rifle, team, prone'
 '3000m walk' '300m free rifle, prone, team'
 '300m free rifle, standing, team' '30m sq' '40m sq'
 '50.8 - 53.52kg (bantamweight)' '50km'
 '50m small bore rifle, standing, individual'
 '53.52 - 57.15kg (featherweight)' '57.15 - 61.24kg (lightweight)'
 '6.5m (rating 1919)' '60 - 67.5kg, one-two hand 3 events (lightweight)'
 '600m free rifle, prone' '600m free rifle, team'
 '61.24 - 66.68kg (welterweight)' '66.68 - 72.57kg (middleweight)'
 '67.5 - 75kg, one-two hand 3 events (middleweight)' '6m (rating 1907)'
 '6m (rating 1919)' '72.57 - 79.38kg (light-heavyweight)'
 '75 - 80kg (light-heavyweight)'
 '75 - 82.5kg, one-two hand 3 e. (light-heavyweight)'
 '75 - 82kg (light-heavyweight)' '8m (rating 1907)' '8m (rating 1919)'
 'Team pursuit (4000m)' 'Figure riding individual' 'Figure riding team'
 'Fixed bird target large birds' 'Fixed bird target large birds teams'
 'Fixed bird target small bird, teams' 'Fixed bird target small birds'
 'Ice hockey' 'Moving bird target 28m teams'
 'Moving bird target 33m teams' 'Moving bird target 50m teams'
 'Moving bird target, 28m' 'Moving bird target, 33m'
 'Moving bird target, 50m' '+ 82.5kg, one-two hand 5 events (heavyweight)'
 '+ 87kg (heavyweight)' '- 56kg (bantamweight)' '- 58kg (bantamweight)'
 '- 60kg, one-two hand 5 events (featherweight)'
 '400, 600, 800m free rifle, team' '56 - 61kg (featherweight)'
 '58 - 62kg (featherweight)'
 '60 - 67.5kg, one-two hand 5 events (lightweight)'
 '600m free rifle, individual' '61 - 66kg (lightweight)'
 '62 - 67.5kg (lightweight)' '66 - 72kg (welterweight)'
 '67.5 - 75kg, one-two hand 5 events (middleweight)'
 '72 - 79kg (middleweight)'
 '75 - 82.5kg, one-two hand 5 e. (light-heavyweight)'
 '79 - 87kg (light-heavyweight)' 'Sidehorse vault'
 'Olympic class monotype' '+ 82.5kg, total (heavyweight)'
 '- 60kg, total (featherweight)' '12 foot dinghy individual' '1km pursuit'
 '58 - 60kg (featherweight)' '60 - 67.5kg, total (lightweight)'
 '67.5 - 75kg, total (middleweight)'
 '75 - 82.5kg, total (light-heavyweight)' '+ 87kg (super heavyweight)'
 '50.8 - 54kg (bantamweight)' '50km walk' '54 - 57.15kg (featherweight)'
 '80m hurdles' 'Floor exercises' 'Indian clubs' 'Tumbling'
 'Two-person keelboat open (star)' 'C-1 1000m (canoe single)' 'C-2 10000m'
 'C-2 1000m (canoe double)' 'K-1 10000m' 'K-1 1000m (kayak single)'
 'K-2 10000m' 'K-2 1000m (kayak double)' 'Basketball' 'Folding k-1 10000m'
 'Folding k-2 10000m' 'Handball' '- 51kg (flyweight)' '- 52kg (flyweight)'
 '- 56kg, total (bantamweight)' '51 - 54kg (bantamweight)'
 '52 - 57kg (bantamweight)' '54 - 58kg (featherweight)'
 '56 - 60kg, total (featherweight)' '57 - 61kg (featherweight)'
 '57 - 63kg (featherweight)' '58 - 62kg (lightweight)'
 '61 - 67kg (lightweight)' '62 - 67kg (welterweight)'
 '63 - 67kg (lightweight)' '67 - 73kg (middleweight)'
 '67 - 73kg (welterweight)' '73 - 79kg (middleweight)'
 '73 - 80kg (light-heavyweight)' 'C-1 10000m' 'K-1 500m (kayak single)'
 'Dragon' 'Firefly class' 'Swallow (golondrina)' '+ 81kg (heavyweight)'
 '+ 90kg, total (heavyweight)' '100m running deer, single/double shots'
 '5.5m' '50m rifle 3 positions (3x40 shots)' '54 - 57kg (featherweight)'
 '57 - 60kg (lightweight)' '60 - 63.5kg (light-welterweight)'
 '63.5 - 67kg (welterweight)' '67 - 71kg (light-middleweight)' '71-75kg'
 '75 - 81kg (light-heavyweight)' '82.5 - 90kg, total (middle-heavyweight)'
 'Balance beam' 'Single-handed dinghy (finn)' 'Team, portable apparatus'
 'Uneven bars' '100m butterfly' '200m butterfly' '20km walk'
 'Sharpie 12m2' '4x100m medley relay' 'K-1 4x500m'
 'K-2 500m (kayak double)' 'Flying dutchman' '+ 97kg (heavyweight)'
 '+ 97kg (super heavyweight)' '- 68kg (lightweight)'
 '400m individual medley' '63 - 70kg (lightweight)'
 '68 - 80kg (middleweight)' '70 - 78kg (welterweight)'
 '78 - 87kg (middleweight)' '87 - 97kg (light-heavyweight)'
 'Individual pursuit' 'K-4 1000m (kayak four)' 'Open category'
 'Volleyball' '- 48kg (light-flyweight)' '100m breaststroke'
 '200m individual medley' '48 - 51kg (flyweight)' '800m freestyle'
 'Skeet (125 targets)' '+ 100kg (super heavyweight)'
 '+ 110kg, total (super heavyweight)' '+ 93kg (heavyweight)'
 '- 52kg, total (flyweight)' '- 63kg (lightweight)' '100m hurdles'
 '48 - 52kg (flyweight)' '50m running target (30+30 shots)'
 '52 - 56kg, total (bantamweight)' '57 - 62kg (featherweight)'
 '62 - 68kg (lightweight)' '63 - 70kg (half-middleweight)'
 '68 - 74kg (welterweight)' '70 - 80kg (middleweight)'
 '74 - 82kg (middleweight)' '80 - 93kg (half-heavyweight)'
 '82 - 90kg (light-heavyweight)' '90 - 100kg (heavyweight)'
 '91 - 110kg, total (heavyweight)' 'C-1 (canoe single)'
 'C-2 (canoe double)' 'K-1 (kayak single)'
 'Fleet/match race keelboat open (soling)' 'Individual fita round'
 'Tempest' '470 - two person dinghy' 'C-1 500m (canoe single)'
 'C-2 500m (canoe double)' 'Tornado - multihull'
 'Pair without coxswain (2-)' 'Quadruple sculls with coxswain (4x)'
 'Quadruple sculls without coxswain (4x)' '+ 95kg (heavyweight)' '- 60 kg'
 '100 - 110kg, total (heavyweight)' '60 - 65kg (half-lightweight)'
 '65 - 71kg (lightweight)' '71 - 78kg (half-middleweight)'
 '78 - 86kg (middleweight)' '86 - 95kg (half-heavyweight)'
 '90 - 100kg, total (first-heavyweight)' '+ 91kg (super heavyweight)'
 '10m air rifle (40 shots)' '10m air rifle (60 shots)'
 '25m pistol (30+30 shots)' '3000m' '50m rifle 3 positions (3x20 shots)'
 '81 - 91kg (heavyweight)' 'K-4 500m (kayak four)' 'Points race'
 'Board (windglider)' 'Duet' 'Heptathlon' 'Solo'
 '100 - 130kg (super heavyweight)' '10m air pistol (40 shots)'
 '10m air pistol (60 shots)' '50m freestyle' 'Board (division ii)'
 'Sprint' '+ 72kg (heavyweight)' '- 48kg (extra-lightweight)'
 '48 - 52kg (half-lightweight)' '52 - 56kg (lightweight)'
 '56 - 61kg (half-middleweight)' '61 - 66kg (middleweight)'
 '66 - 72kg (half-heavyweight)' 'Baseball' 'Board (lechner)'
 'Coxless four (4-)' 'Individual (fita olympic round - 70m)'
 'Single-handed dinghy (europe)' 'Team (fita olympic round - 70m)'
 '+ 100kg (heavyweight)' '+ 108kg, total (super heavyweight)'
 '- 54kg, total (flyweight)' '54 - 59kg, total (bantamweight)'
 '59 - 64kg, total (featherweight)' '60 - 66kg (half-lightweight)'
 '64 - 70kg, total (lightweight)' '66 - 73kg (lightweight)'
 '70 - 76kg, total (middleweight)' '73 - 81kg (half-middleweight)'
 '76 - 83kg, total (light-heavyweight)' '81 - 90kg (middleweight)'
 '83 - 91kg, total (middle-heavyweight)' '90 - 100kg (half-heavyweight)'
 '91 - 99kg, total (first-heavyweight)' '99 - 108kg, total (heavyweight)'
 'Beach volleyball' 'Board (mistral)' 'Cross-country'
 'Double trap (120 targets)' 'Double trap (150 targets)'
 'Group competition' 'Lightweight coxless four (4-)'
 'Lightweight double sculls (2x)' 'Single-handed dinghy open (laser)'
 'Softball' '+ 105kg' '+ 67 kg' '+ 75kg' '+ 78kg (heavyweight)' '+ 80 kg'
 '- 49 kg' '- 58 kg' '105kg' '10m running target (30+30 shots)'
 '20km race walk' '48 - 54kg' '48kg' '49 - 57 kg' '49er - skiff'
 '500m time trial' '52 - 57kg (lightweight)' '53kg' '54 - 58kg' '56kg'
 '57 - 63kg (half-middleweight)' '57 - 67 kg' '58 - 63kg' '58 - 68 kg'
 '58kg' '62kg' '63 - 69kg' '63 - 70kg (middleweight)' '63kg' '68 - 80 kg'
 '69 - 76kg' '69kg' '70 - 78kg (half-heavyweight)' '75kg' '76 - 85kg'
 '77kg' '85 - 97kg' '85kg' '94kg' '97 - 130kg' 'Keirin' 'Madison'
 'Olympic sprint' 'Skeet (75 targets)' 'Synchronized diving 10m platform'
 'Synchronized diving 3m springboard' 'Trap (75 targets)' '- 48 kg'
 '- 48kg' '- 55kg' '48 - 55kg' '48kg (light flywieght)' '55 - 60kg'
 '55 - 63kg' '60 - 64 kg' '60 - 66kg' '63 - 72kg' '64 - 69 kg' '66 - 74kg'
 '69 - 75 kg' '74 - 84kg' '84 - 96kg' '96 - 120kg' 'Star - keelboat'
 'Team sprint' 'Yngling - keelboat']

In [109]:
dir(odf['Event'].str)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_data',
 '_doc_args',
 '_freeze',
 '_get_series_list',
 '_index',
 '_inferred_dtype',
 '_is_categorical',
 '_is_string',
 '_name',
 '_orig',
 '_parent',
 '_validate',
 '_wrap_result',
 'capitalize',
 'casefold',
 'cat',
 'center',
 'contains',
 'count',
 'decode',
 'encode',
 'endswith',
 'extract',
 'extractall',
 'find',
 'findall',
 'fullmatch',
 'get',
 'get_dummies',
 'index',
 'isalnum',
 'isalpha',
 'isdecimal',
 'isdigit',
 'islower',
 'isnumeric',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'len',
 'ljust',
 'lower',
 'lstrip',
 'match',
 'normalize',
 'pad',
 'partition',
 'removeprefix',
 'removesuffix',
 'repeat',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'slice',
 'slice_replace',
 'split',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'wrap',
 'zfill']

In [108]:
print(odf[odf['Athlete Name'].str.contains("LATYNINA")])

       Year                   City       Sport   Discipline      Athlete Name  NOC Gender                     Event Event Gender   Medal  Position
9372   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women           floor exercises            W    Gold         1
9539   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women      individual all-round            W    Gold         1
9679   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women          team competition            W    Gold         1
9702   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women  team, portable apparatus            W  Bronze         3
9735   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women               uneven bars            W  Silver         2
9741   1956  Melbourne / Stockholm  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women                     vault            W    Gold         1
10179  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women              balance beam            W  Silver         2
10277  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women           floor exercises            W    Gold         1
10458  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women      individual all-round            W    Gold         1
10576  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women          team competition            W    Gold         1
10612  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women               uneven bars            W  Silver         2
10616  1960                   Rome  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women                     vault            W  Bronze         3
11095  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women              balance beam            W  Bronze         3
11195  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women           floor exercises            W    Gold         1
11387  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women      individual all-round            W  Silver         2
11517  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women          team competition            W    Gold         1
11551  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women               uneven bars            W  Bronze         3
11558  1964                  Tokyo  Gymnastics  Artistic G.  LATYNINA, Larisa  URS  Women                     vault            W  Silver         2

In [112]:
print(odf.sample(5))
odf['City'] = odf['City'].str.upper()
print(odf.sample(5))

       Year                   City          Sport       Discipline                   Athlete Name  NOC Gender                             Event Event Gender   Medal  Position
9449   1956  Melbourne / stockholm         Rowing           Rowing          LOOMER, Lorne Kenneth  CAN    Men        four without coxswain (4-)            M    Gold         1
14219  1976               Montreal  Weightlifting    Weightlifting                   KOROL, Pyotr  URS    Men  60 - 67.5kg, total (lightweight)            M    Gold         1
1519   1908                 London       Football         Football  RASMUSSEN, BjÃ¶rn Vilhelm Ravn  DEN    Men                          football            M  Silver         2
6952   1936                 Berlin         Hockey           Hockey                PETER, Heinrich  GER    Men                            hockey            M  Silver         2
18572  1988                  Seoul  Canoe / Kayak  Canoe / Kayak F   MAC DONALD, Christopher Paul  NZL    Men           K-2 500m (kayak double)            M    Gold         1
       Year                   City          Sport     Discipline               Athlete Name  NOC Gender                        Event Event Gender   Medal  Position
26067  2004                 ATHENS     Basketball     Basketball             THOMPSON, Tina  USA  Women                   basketball            W    Gold         1
3068   1920                ANTWERP       Aquatics       Swimming       WOODBRIDGE, Margaret  USA  Women               400m freestyle            W  Silver         2
8923   1956  MELBOURNE / STOCKHOLM         Boxing         Boxing           DOBRESCU, Mircea  ROU    Men           - 51kg (flyweight)            M  Silver         2
10683  1964                  TOKYO  Weightlifting  Weightlifting        ZHABOTINSKY, Leonid  URS    Men  + 90kg, total (heavyweight)            M    Gold         1
15367  1980                 MOSCOW       Aquatics       Swimming  DAVIES, Sharron Elizabeth  GBR  Women       400m individual medley            W  Silver         2

## Pandas - Series and DataFrames

1. create Series with Index
2. create DataFrames => from => list, numPy array, dictionary, Pandas series

In [55]:
my_list = ["Mary", "John", "Brian", "Ravi", "Sheen"]
my_pd = pd.Series(my_list, index=['Music leader', 'Drummer', 'Guitarist', 'Bassist', 'Vocalist'])
print(my_pd)
print("\n")
my_pd = my_pd + " Year11"
print(my_pd)

Music leader     Mary
Drummer          John
Guitarist       Brian
Bassist          Ravi
Vocalist        Sheen
dtype: object


Music leader     Mary Year11
Drummer          John Year11
Guitarist       Brian Year11
Bassist          Ravi Year11
Vocalist        Sheen Year11
dtype: object

In [44]:
student = ['Kasey', 'John', 'Mary', 'Ravi', 'Sheen']
df1 = pd.DataFrame(student, columns=['Student'])
print(df1)

grades = ['B-', 'A+', 'A', 'B', 'C']
df2 = pd.DataFrame({'Student': student, 'Grade': grades})
print(df2)

my_dict = {'Student': student, 'Grade': grades}
df3 = pd.DataFrame(my_dict)
print(df3)

  Student
0   Kasey
1    John
2    Mary
3    Ravi
4   Sheen
  Student Grade
0   Kasey    B-
1    John    A+
2    Mary     A
3    Ravi     B
4   Sheen     C
  Student Grade
0   Kasey    B-
1    John    A+
2    Mary     A
3    Ravi     B
4   Sheen     C

In [45]:
year = pd.Series([2020, 2021, 2022, 2023, 2024])
energy_consumption = pd.Series([100, 150, 200, 250, 300])
df4 = pd.DataFrame({'Year': year, 'Energy Consumption': energy_consumption})
print(df4)

# we can create a new dataframe using random values
import numpy as np

df5 = pd.DataFrame(np.random.randn(5, 2), columns=['Trial1', 'Trial2'])
print(df5)

   Year  Energy Consumption
0  2020                 100
1  2021                 150
2  2022                 200
3  2023                 250
4  2024                 300
     Trial1    Trial2
0  0.965379 -0.180343
1  0.151596 -1.178845
2 -1.023644  0.728217
3 -1.866974  1.000044
4 -0.817774  1.533684

## Accessing and modifying series

In [ ]:
operators = ['AT&T', 'Verizon', 'T-Mobile', 'Sprint']
revenue = [100, 200, 150, 120]

# creating a Series from lists
telecom = pd.Series(revenue, index=operators)
print(telecom)
print("\n")
#print(telecom[:3])
#print(telecom[-1])
print(telecom['Verizon'])
print("\n")
print(telecom[-2:])
print("\n")
print(telecom[[0,2,3]])
print("\n")
print(telecom[['AT&T', 'T-Mobile']])
print("\n")
print(telecom[:'T-Mobile'])  # Slicing by index label
print("\n")
print(telecom[['AT&T', 'Verizon', 'T-Mobile']])  # Slicing by index label
print("\n")
print(telecom[telecom > 150])

AT&T        100
Verizon     200
T-Mobile    150
Sprint      120
dtype: int64


200


T-Mobile    150
Sprint      120
dtype: int64


AT&T        100
T-Mobile    150
Sprint      120
dtype: int64


AT&T        100
T-Mobile    150
dtype: int64


AT&T        100
Verizon     200
T-Mobile    150
dtype: int64


AT&T        100
Verizon     200
T-Mobile    150
dtype: int64

/var/folders/y7/j6gtt94n4n579l19ydymnm8r0000gn/T/ipykernel_53935/2145807529.py:14: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(telecom[[0,2,3]])

## Accessing DataFrames

In [53]:
# Create DataFrame using dictionary
store_data = pd.DataFrame({
    'CustoimerID': ['CustID00','CustID01', 'CustID02', 'CustID03', 'CustID04'],
    'location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'type': ['Electornics', 'Food&Beverage', 'Clothing', 'Electornics', 'Food&Beverage'],
    'quantity': [5, 10, 15, 20, 25],
    'total_bill': [500, 1000, 1500, 2000, 2500]
})
print(store_data)
print("\n")
# Accessing the first row
print(store_data[:1])  # Using slicing
print("\n")
print(store_data[::2])
print("\n")
print(store_data['location'])
print("\n")
print(store_data[['location','type']])
print("\n")
print(store_data[::-1])

  CustoimerID     location gender           type  quantity  total_bill
0    CustID00     New York      F    Electornics         5         500
1    CustID01  Los Angeles      M  Food&Beverage        10        1000
2    CustID02      Chicago      F       Clothing        15        1500
3    CustID03      Houston      M    Electornics        20        2000
4    CustID04      Phoenix      F  Food&Beverage        25        2500


  CustoimerID  location gender         type  quantity  total_bill
0    CustID00  New York      F  Electornics         5         500


  CustoimerID  location gender           type  quantity  total_bill
0    CustID00  New York      F    Electornics         5         500
2    CustID02   Chicago      F       Clothing        15        1500
4    CustID04   Phoenix      F  Food&Beverage        25        2500


0       New York
1    Los Angeles
2        Chicago
3        Houston
4        Phoenix
Name: location, dtype: object


      location           type
0     New York    Electornics
1  Los Angeles  Food&Beverage
2      Chicago       Clothing
3      Houston    Electornics
4      Phoenix  Food&Beverage


  CustoimerID     location gender           type  quantity  total_bill
4    CustID04      Phoenix      F  Food&Beverage        25        2500
3    CustID03      Houston      M    Electornics        20        2000
2    CustID02      Chicago      F       Clothing        15        1500
1    CustID01  Los Angeles      M  Food&Beverage        10        1000
0    CustID00     New York      F    Electornics         5         500

## Accessing and modifying DataFrames (loc, iloc)
1. loc method => dataframe.loc[row selection, column selection]
2. iloc => i stands for index (integre number )

In [67]:
# Create DataFrame using dictionary
store_data = pd.DataFrame({
    'CustoimerID': ['CustID00','CustID01', 'CustID02', 'CustID03', 'CustID04'],
    'location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'type': ['Electornics', 'Food&Beverage', 'Clothing', 'Electornics', 'Food&Beverage'],
    'quantity': [5, 10, 15, 20, 25],
    'total_bill': [500, 1000, 1500, 2000, 2500]
})
print(store_data)
print("\n")
print(store_data.loc[1])
print("\n")
print(store_data.loc[1,'total_bill'])  # Accessing a specific cell using loc
print("\n")
print(store_data.iloc[1, 5])  # Accessing a specific cell using iloc
print("\n")
print(store_data.iloc[1:3, 2:5])  # Accessing a range of rows and columns using iloc
print("\n")
print(store_data.loc[[1,4], ['location', 'type']])  # Accessing specific rows and columns using loc
print("\n")
print(store_data.loc[store_data['total_bill'] > 1500])  
print("\n")
print(store_data.loc[4,'type'])
store_data.loc[4, 'type'] = "Food and Beverages"
print(store_data.loc[4, 'type'])
print("\n")
print(store_data)

  CustoimerID     location gender           type  quantity  total_bill
0    CustID00     New York      F    Electornics         5         500
1    CustID01  Los Angeles      M  Food&Beverage        10        1000
2    CustID02      Chicago      F       Clothing        15        1500
3    CustID03      Houston      M    Electornics        20        2000
4    CustID04      Phoenix      F  Food&Beverage        25        2500


CustoimerID         CustID01
location         Los Angeles
gender                     M
type           Food&Beverage
quantity                  10
total_bill              1000
Name: 1, dtype: object


1000


1000


  gender           type  quantity
1      M  Food&Beverage        10
2      F       Clothing        15


      location           type
1  Los Angeles  Food&Beverage
4      Phoenix  Food&Beverage


  CustoimerID location gender           type  quantity  total_bill
3    CustID03  Houston      M    Electornics        20        2000
4    CustID04  Phoenix      F  Food&Beverage        25        2500


Food&Beverage
Food and Beverages


  CustoimerID     location gender                type  quantity  total_bill
0    CustID00     New York      F         Electornics         5         500
1    CustID01  Los Angeles      M       Food&Beverage        10        1000
2    CustID02      Chicago      F            Clothing        15        1500
3    CustID03      Houston      M         Electornics        20        2000
4    CustID04      Phoenix      F  Food and Beverages        25        2500

## Accessing and Modifying DataFrames (condition-based indexing)

1. Conditional indexing using .loc
2. Add a new column
3. Drop a column (returns a new dataframe and original is unmodified unless inplace=True is used)
4. Use .copy() to create a new dataframe to avoid original one getting modified.
5. dataframe.reset_index

In [57]:
# Create DataFrame using dictionary
store_data = pd.DataFrame({
    'CustoimerID': ['CustID00','CustID01', 'CustID02', 'CustID03', 'CustID04'],
    'location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'type': ['Electornics', 'Food&Beverage', 'Clothing', 'Electornics', 'Food&Beverage'],
    'quantity': [5, 10, 15, 20, 25],
    'total_bill': [500, 1000, 1500, 2000, 2500]
})
print(store_data)
print("\n")
print(store_data['quantity']>10)
print("\n")
print(store_data.loc[store_data['quantity'] > 10])
print("\n")
store_data['ratings'] = [4.5, 3.8, 4.2, 4.0, 4.7]
print(store_data)
print("\n")
print(store_data.drop('ratings', axis=1))
print("\n")
print(store_data)
print("\n")
store_data.drop(0, axis=0,inplace=True)  
print(store_data)

  CustoimerID     location gender           type  quantity  total_bill
0    CustID00     New York      F    Electornics         5         500
1    CustID01  Los Angeles      M  Food&Beverage        10        1000
2    CustID02      Chicago      F       Clothing        15        1500
3    CustID03      Houston      M    Electornics        20        2000
4    CustID04      Phoenix      F  Food&Beverage        25        2500


0    False
1    False
2     True
3     True
4     True
Name: quantity, dtype: bool


  CustoimerID location gender           type  quantity  total_bill
2    CustID02  Chicago      F       Clothing        15        1500
3    CustID03  Houston      M    Electornics        20        2000
4    CustID04  Phoenix      F  Food&Beverage        25        2500


  CustoimerID     location gender           type  quantity  total_bill  ratings
0    CustID00     New York      F    Electornics         5         500      4.5
1    CustID01  Los Angeles      M  Food&Beverage        10        1000      3.8
2    CustID02      Chicago      F       Clothing        15        1500      4.2
3    CustID03      Houston      M    Electornics        20        2000      4.0
4    CustID04      Phoenix      F  Food&Beverage        25        2500      4.7


  CustoimerID     location gender           type  quantity  total_bill
0    CustID00     New York      F    Electornics         5         500
1    CustID01  Los Angeles      M  Food&Beverage        10        1000
2    CustID02      Chicago      F       Clothing        15        1500
3    CustID03      Houston      M    Electornics        20        2000
4    CustID04      Phoenix      F  Food&Beverage        25        2500


  CustoimerID     location gender           type  quantity  total_bill  ratings
0    CustID00     New York      F    Electornics         5         500      4.5
1    CustID01  Los Angeles      M  Food&Beverage        10        1000      3.8
2    CustID02      Chicago      F       Clothing        15        1500      4.2
3    CustID03      Houston      M    Electornics        20        2000      4.0
4    CustID04      Phoenix      F  Food&Beverage        25        2500      4.7


  CustoimerID     location gender           type  quantity  total_bill  ratings
1    CustID01  Los Angeles      M  Food&Beverage        10        1000      3.8
2    CustID02      Chicago      F       Clothing        15        1500      4.2
3    CustID03      Houston      M    Electornics        20        2000      4.0
4    CustID04      Phoenix      F  Food&Beverage        25        2500      4.7

## Combining dataframes
1. Concatenate using pd.concat()
2. Merge => Merge combines dataframes using a column's values to identify common entries
3. Join => behaves much like merge except instead of using the values of one of the columns to combine data frames, it uses index labels

In Pandas, 'merging out' typically refers to expanding data beyond the initial keys using methods like left, right, or outer joins.

In [84]:
data_cust = pd.DataFrame({
    'customerID': ['101', '102', '103', '104'],
    'category': ['Medium', 'High', 'Low', 'Medium'],
    'first visit': ['yes', 'no', 'yes', 'no'],
    'sales': [1000, 2000, 1500, 3000]}, index=[0, 1, 2, 3])
print(data_cust)
print("\n")

data_cust_new = pd.DataFrame({
    'customerID': ['101', '102', '103', '104'],
    'distance': [12, 9, 15, 10],
    'sales': [1000, 2000, 1500, 3000]}, index=[4, 5, 6, 7])
print(data_cust_new)
print("\n")

print(pd.concat([data_cust, data_cust_new], axis=0))
print("\n")
print(pd.concat([data_cust, data_cust_new], axis=1))
print("\n")

  customerID category first visit  sales
0        101   Medium         yes   1000
1        102     High          no   2000
2        103      Low         yes   1500
3        104   Medium          no   3000


  customerID  distance  sales
4        101        12   1000
5        102         9   2000
6        103        15   1500
7        104        10   3000


  customerID category first visit  sales  distance
0        101   Medium         yes   1000       NaN
1        102     High          no   2000       NaN
2        103      Low         yes   1500       NaN
3        104   Medium          no   3000       NaN
4        101      NaN         NaN   1000      12.0
5        102      NaN         NaN   2000       9.0
6        103      NaN         NaN   1500      15.0
7        104      NaN         NaN   3000      10.0


  customerID category first visit   sales customerID  distance   sales
0        101   Medium         yes  1000.0        NaN       NaN     NaN
1        102     High          no  2000.0        NaN       NaN     NaN
2        103      Low         yes  1500.0        NaN       NaN     NaN
3        104   Medium          no  3000.0        NaN       NaN     NaN
4        NaN      NaN         NaN     NaN        101      12.0  1000.0
5        NaN      NaN         NaN     NaN        102       9.0  2000.0
6        NaN      NaN         NaN     NaN        103      15.0  1500.0
7        NaN      NaN         NaN     NaN        104      10.0  3000.0

In [95]:
data_cust = pd.DataFrame({
    'customerID': ['101', '102', '103', '104'],
    'category': ['Medium', 'High', 'Low', 'Medium'],
    'first visit': ['yes', 'no', 'yes', 'no'],
    'sales': [1000, 2000, 1500, 3000]}, index=[0, 1, 2, 3])
print(data_cust)
print("\n")

data_cust_new = pd.DataFrame({
    'customerID': ['101', '102', '103', '104','105'],
    'distance': [12, 9, 15, 10, 34],
    'sales': [1000, 2000, 1500, 3500, 6000]}, index=[4, 5, 6, 7, 11])
print(data_cust_new)
print("\n")

print(pd.merge(data_cust, data_cust_new, on='customerID', how='outer'))  # Outer join => Union
print("\n")
print(pd.merge(data_cust, data_cust_new, on='customerID', how='inner'))  # Inner join => Intersection
print("\n")
print(pd.merge(data_cust, data_cust_new, on='customerID', how='right'))  # Right join => Right side

  customerID category first visit  sales
0        101   Medium         yes   1000
1        102     High          no   2000
2        103      Low         yes   1500
3        104   Medium          no   3000


   customerID  distance  sales
4         101        12   1000
5         102         9   2000
6         103        15   1500
7         104        10   3500
11        105        34   6000


  customerID category first visit  sales_x  distance  sales_y
0        101   Medium         yes   1000.0        12     1000
1        102     High          no   2000.0         9     2000
2        103      Low         yes   1500.0        15     1500
3        104   Medium          no   3000.0        10     3500
4        105      NaN         NaN      NaN        34     6000


  customerID category first visit  sales_x  distance  sales_y
0        101   Medium         yes     1000        12     1000
1        102     High          no     2000         9     2000
2        103      Low         yes     1500        15     1500
3        104   Medium          no     3000        10     3500


  customerID category first visit  sales_x  distance  sales_y
0        101   Medium         yes   1000.0        12     1000
1        102     High          no   2000.0         9     2000
2        103      Low         yes   1500.0        15     1500
3        104   Medium          no   3000.0        10     3500
4        105      NaN         NaN      NaN        34     6000

In [99]:
data_quarters = pd.DataFrame({ 
    'Q1' : [101, 102,103],
    'Q2' : [201, 202, 203]},
    index=['I0', 'I1', 'I2']
)

data_quarters_new = pd.DataFrame({
    'Q3': [301, 302, 303],
    'Q4': [401, 402, 403]
}, index = ['I0', 'I1', 'I2'])

print(data_quarters)
print("\n")
print(data_quarters_new)
print("\n")

print(data_quarters.join(data_quarters_new, how='right'))  # Right join
print("\n")
print(data_quarters.join(data_quarters_new, how='left'))

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203


     Q3   Q4
I0  301  401
I1  302  402
I2  303  403


     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  302  402
I2  103  203  303  403


     Q1   Q2   Q3   Q4
I0  101  201  301  401
I1  102  202  302  402
I2  103  203  303  403

## Saving and loading datasets
1. pd.read_csv(), pd.read_excel()
2. data.to_csv('name of the file.csv', index=False), data.to_excel('name of the file.xlsx', index=False)

In [ ]:
data = pd.read_csv('./data/StockData.csv')
print(data.head(10))
print("\n")
print(data.describe())
print("\n")
print(data.info())

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556
5  AAPL  15-02-2013  65.7371
6  AAPL  19-02-2013  65.7128
7  AAPL  20-02-2013  64.1214
8  AAPL  21-02-2013  63.7228
9  AAPL  22-02-2013  64.4014


             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB
None

## Pandas functions
data.tail()
data.head()
data.shape()
data.info()
data.describe()
data.mean()
data.median()
data.mode()

Data is typically time-series and can be analyzed for trends, patterns, and staistical summaries, making it essential in financial analysis and forecasting

In [114]:
data = pd.read_csv('./data/StockData.csv')
print(data.shape, "\n")
print(data['price'].max(), "\n")
print(data['stock'].unique(), "\n")
print(data['stock'].value_counts(), "\n")
print(data['price'].mode()[0], "\n")

(5036, 3)

179.26

['AAPL' 'SNI' 'TJX' 'ZTS']

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

74.59

## Pandas functions (groupby)
Used to split the data into groups based on some criteria.
Key differences between `groupby` aggregation and `transform`:
- `transform` returns a DataFrame/Series with the same shape as the input
- `groupby` with aggregation returns reduced results (one row per group)
- `transform` is useful for calculating group-level statistics while maintaining the original data structure

apply() function
sort_values()

The groupby() function in Pandas facilitates the splitting of a DataFrame into groups based on specified criteria, such as unique values in one or more columns, followed by the application of a function to each group, enabling aggregation, tranformation, or analysis of grouped data.

In [126]:
data = pd.read_csv('./data/StockData.csv')
print(data.head())
print("\n")
print(data.groupby(['stock'])['price'].sum())
print("\n")
print(data.groupby(['stock'])['price'].value_counts())
print("\n")
print(data.groupby(['stock'])['price'].transform('sum'))

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556


stock
AAPL    137314.9734
SNI      89790.8800
TJX      84030.1500
ZTS      56779.1980
Name: price, dtype: float64


stock  price
AAPL   97.34     3
       99.62     3
       100.75    3
       106.82    3
       126.60    3
                ..
ZTS    78.33     1
       78.35     1
       79.18     1
       79.25     1
       80.09     1
Name: count, Length: 4225, dtype: int64


0       137314.9734
1       137314.9734
2       137314.9734
3       137314.9734
4       137314.9734
           ...
5031     56779.1980
5032     56779.1980
5033     56779.1980
5034     56779.1980
5035     56779.1980
Name: price, Length: 5036, dtype: float64

In [134]:
import pandas as pd

# Create sample DataFrame
df = pd.DataFrame({
    'store': ['A', 'A', 'A', 'B', 'B', 'B'],
    'product': ['P1', 'P2', 'P3', 'P1', 'P2', 'P3'],
    'sales': [100, 200, 150, 300, 400, 250]
})

# 1. Simple transform example - Calculate mean sales per store
df['store_mean'] = df.groupby('store')['sales'].transform('mean')
print(df)
print("\n")
print(df.groupby('store')['sales'].transform('min'))
print("\n")
# 2. custom tranform function
def subtract_min(x):
    #print(x)
    return x - x.min()
# Apply custom transform function
df['sales_above_min'] = df.groupby('store')['sales'].transform(subtract_min)
print("\n")
print(df)

# Mean per group
df.groupby('store')['sales'].transform('mean')

# Sum per group
df.groupby('store')['sales'].transform('sum')

# Size of group
df.groupby('store')['sales'].transform('size')

# Rank within group
df.groupby('store')['sales'].transform('rank')

  store product  sales  store_mean
0     A      P1    100  150.000000
1     A      P2    200  150.000000
2     A      P3    150  150.000000
3     B      P1    300  316.666667
4     B      P2    400  316.666667
5     B      P3    250  316.666667


0    100
1    100
2    100
3    250
4    250
5    250
Name: sales, dtype: int64




  store product  sales  store_mean  sales_above_min
0     A      P1    100  150.000000                0
1     A      P2    200  150.000000              100
2     A      P3    150  150.000000               50
3     B      P1    300  316.666667               50
4     B      P2    400  316.666667              150
5     B      P3    250  316.666667                0

0    1.0
1    3.0
2    2.0
3    2.0
4    3.0
5    1.0
Name: sales, dtype: float64

In [135]:
# Create more complex DataFrame
sales_df = pd.DataFrame({
    'store': ['A', 'A', 'B', 'B', 'C', 'C'],
    'category': ['food', 'electronics', 'food', 'electronics', 'food', 'electronics'],
    'sales': [100, 200, 150, 300, 250, 400],
    'units': [10, 5, 15, 8, 20, 10]
})

# Multiple transformations
sales_df['sales_ratio'] = sales_df.groupby('store')['sales'].transform(
    lambda x: x / x.mean()
)
sales_df['category_avg'] = sales_df.groupby('category')['sales'].transform('mean')

print("Sales DataFrame with multiple transforms:")
print(sales_df)

Sales DataFrame with multiple transforms:
  store     category  sales  units  sales_ratio  category_avg
0     A         food    100     10     0.666667    166.666667
1     A  electronics    200      5     1.333333    300.000000
2     B         food    150     15     0.666667    166.666667
3     B  electronics    300      8     1.333333    300.000000
4     C         food    250     20     0.769231    166.666667
5     C  electronics    400     10     1.230769    300.000000

In [138]:
def profits(s):
    return s + s * 0.10 # increase of 10%

print(data)
data['new price'] = data['price'].apply(profits)
print(data)

     stock        date    price
0     AAPL  08-02-2013  67.8542
1     AAPL  11-02-2013  68.5614
2     AAPL  12-02-2013  66.8428
3     AAPL  13-02-2013  66.7156
4     AAPL  14-02-2013  66.6556
...    ...         ...      ...
5031   ZTS  01-02-2018  77.8200
5032   ZTS  02-02-2018  76.7800
5033   ZTS  05-02-2018  73.8300
5034   ZTS  06-02-2018  73.2700
5035   ZTS  07-02-2018  73.8600

[5036 rows x 3 columns]
     stock        date    price  new price
0     AAPL  08-02-2013  67.8542   74.63962
1     AAPL  11-02-2013  68.5614   75.41754
2     AAPL  12-02-2013  66.8428   73.52708
3     AAPL  13-02-2013  66.7156   73.38716
4     AAPL  14-02-2013  66.6556   73.32116
...    ...         ...      ...        ...
5031   ZTS  01-02-2018  77.8200   85.60200
5032   ZTS  02-02-2018  76.7800   84.45800
5033   ZTS  05-02-2018  73.8300   81.21300
5034   ZTS  06-02-2018  73.2700   80.59700
5035   ZTS  07-02-2018  73.8600   81.24600

[5036 rows x 4 columns]

In [141]:
data.sort_values(by='new price', ascending=False)

     stock        date   price  new price
1244  AAPL  18-01-2018  179.26    197.186
1243  AAPL  17-01-2018  179.10    197.010
1245  AAPL  19-01-2018  178.46    196.306
1241  AAPL  12-01-2018  177.09    194.799
1247  AAPL  23-01-2018  177.04    194.744
...    ...         ...     ...        ...
4076   ZTS  17-04-2014   28.60     31.460
4074   ZTS  15-04-2014   28.55     31.405
4075   ZTS  16-04-2014   28.53     31.383
4073   ZTS  14-04-2014   28.48     31.328
4072   ZTS  11-04-2014   28.40     31.240

[5036 rows x 4 columns]

## Pandas functions (datetime)
Date and time objects can be formatted into readable strings using the **strftime()** method, which allows you to specify the format, such as %y-%m-%d for "Year-Month-Day".
In Pandas, .dt is an accessor to access date and time properties from Series values of datetime64 dtype.

Pandas provide powerful datetime functions for efficient manipulation and analysis of date and time data within DataFrame objects, including parsing, conversion, extraction, and arithmetic operations, enabling comprehensive time-series analysis and data handling.

In [63]:
data = pd.read_csv('./data/StockData.csv')
print(data.sample(5))
print("\n")
data['date'] = pd.to_datetime(data['date'],dayfirst=True)
print(data.info())
print("\n")
print(data.sample(5))
print("\n")
print(data['date'].dt.strftime('%m/%d/%Y'))  
print("\n")
print(data['date'].dt.year)  
print("\n")
print(data['date'].dt.month)
print("\n")
print(data['date'].dt.day)  
print("\n")
print(data['date'].dt.weekday)  
print("\n")
print(data['date'][1] - data['date'][0])
print("\n")
print(data.head(2))

     stock        date     price
115   AAPL  25-07-2013   62.6428
2838   TJX  19-05-2014   58.4000
5012   ZTS  04-01-2018   72.5300
948   AAPL  11-11-2016  108.4300
2791   TJX  12-03-2014   61.5100


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   datetime64[ns]
 2   price   5036 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 118.2+ KB
None


     stock       date     price
666   AAPL 2015-10-01  109.5800
193   AAPL 2013-11-13   74.3762
1335   SNI 2013-05-30   68.2400
2778   TJX 2014-02-21   60.0800
677   AAPL 2015-10-16  111.0400


0       02/08/2013
1       02/11/2013
2       02/12/2013
3       02/13/2013
4       02/14/2013
           ...
5031    02/01/2018
5032    02/02/2018
5033    02/05/2018
5034    02/06/2018
5035    02/07/2018
Name: date, Length: 5036, dtype: object


0       2013
1       2013
2       2013
3       2013
4       2013
        ...
5031    2018
5032    2018
5033    2018
5034    2018
5035    2018
Name: date, Length: 5036, dtype: int32


0       2
1       2
2       2
3       2
4       2
       ..
5031    2
5032    2
5033    2
5034    2
5035    2
Name: date, Length: 5036, dtype: int32


0        8
1       11
2       12
3       13
4       14
        ..
5031     1
5032     2
5033     5
5034     6
5035     7
Name: date, Length: 5036, dtype: int32


0       4
1       0
2       1
3       2
4       3
       ..
5031    3
5032    4
5033    0
5034    1
5035    2
Name: date, Length: 5036, dtype: int32


3 days 00:00:00


  stock       date    price
0  AAPL 2013-02-08  67.8542
1  AAPL 2013-02-11  68.5614

In [160]:
import datetime

date = datetime.date(2022, 1, 29)
print(date)

2022-01-29

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'customer':[101, 102, 103, 104],
    'category':['cat2', 'cat2', 'cat1', 'cat3'],
    'important':['yes', 'no', 'yes', 'yes'],
    'sales':[123, 52, 214, 663]    
})
print(df['category'].value_counts())
print(df.groupby(['category'])['customer'].value_counts() )

category
cat2    2
cat1    1
cat3    1
Name: count, dtype: int64

TypeError: 'DataFrame' object is not callable